const mockNoticeData = [
  {
    type: "시험 안내",
    id: "250605_1",
    title: "공지사항 테스트중입니다.",
    author: "관리자",
    date: "2025-06-05",
    content: "테스트 중입니다.",
    attachments: [
      { name: "test.pdf", url: "" },
      { name: "test.xlsx", url: "" },
    ],
  },
  // {
  //   type: "기타 공지",
  //   id: "250408_1",
  //   title: "입시설명회 신청 안내",
  //   author: "원장님",
  //   date: "2025-04-10",
  //   content: "입시설명회 신청 안내",
  //   attachments: [],
  // },
  // {
  //   type: "기타 공지",
  //   id: "250405_1",
  //   title: "학부모 상담 일정 변경",
  //   author: "원장님",
  //   date: "2025-04-05",
  //   content:
  //     "학부모 상담 일정 변경 안내입니다. \n\n <📆상담 기간> \n -25.04.07 ~ 25.04.21",
  //   attachments: [],
  // },
  // {
  //   type: "시험 안내",
  //   id: "250325_1",
  //   title: "4월 트레이닝 일정",
  //   author: "원장님",
  //   date: "2025-03-25",
  //   content: "4월 트레이닝 일정 안내입니다. \n 아래 첨부파일을 확인해주세요.",
  //   attachments: [
  //     {
  //       name: "25년03월_트레이닝_일정.pdf",
  //       url: "/files/25년03월_트레이닝_일정.pdf",
  //     },
  //   ],
  // },
  // {
  //   type: "기타 공지",
  //   id: "250319_1",
  //   title: "공지공지",
  //   author: "원장님",
  //   date: "2025-03-19",
  //   content: "",
  //   attachments: [
  //     {
  //       name: "파일.pdf",
  //       url: "파일.pdf",
  //     },
  //   ],
  // },
  // {
  //   type: "시험 안내",
  //   id: "250310_1",
  //   title: "3월 정규 테스트",
  //   author: "원장님",
  //   date: "2025-03-10",
  //   content:
  //     "3월 정규 테스트 일정 안내입니다. \n\n <📆테스트 일시> \n -고2: 25.03.21 \n -고3: 25.03.22 \n\n <🏋️‍♀️테스트 항목> \n -팔굽혀펴기 (A: 4500~ B: 4000~ C: 3500~ D: 3000~ E: 2500~) \n -턱걸이 (A: 4000~ B: 3500~ C: 3000~ D: 2500~ E: 2000~)  \n\n (기준 미달 시 재시 예정)",
  //   attachments: [
  //     { name: "실기시험_안내.pdf", url: "/files/실기시험_안내.pdf" },
  //     { name: "시험일정.xlsx", url: "/files/시험일정.xlsx" },
  //   ],
  // },
  // {
  //   type: "기타 공지",
  //   id: "250308_1",
  //   title: "입시설명회 신청 안내",
  //   author: "원장님",
  //   date: "2025-03-10",
  //   content: "입시설명회 신청 안내",
  //   attachments: [],
  // },
  // {
  //   type: "기타 공지",
  //   id: "250305_1",
  //   title: "학부모 상담 일정 변경",
  //   author: "원장님",
  //   date: "2025-03-05",
  //   content:
  //     "학부모 상담 일정 변경 안내입니다. \n\n <📆상담 기간> \n -25.03.07 ~ 25.03.21",
  //   attachments: [],
  // },
  // {
  //   type: "시험 안내",
  //   id: "250225_1",
  //   title: "3월 트레이닝 일정 안내",
  //   author: "원장님",
  //   date: "2025-02-25",
  //   content: "3월 트레이닝 일정 안내입니다. \n 아래 첨부파일을 확인해주세요.",
  //   attachments: [
  //     {
  //       name: "25년03월_트레이닝_일정.pdf",
  //       url: "/files/25년03월_트레이닝_일정.pdf",
  //     },
  //   ],
  // },
  // {
  //   type: "기타 공지",
  //   id: "250219_1",
  //   title: "2월 정규 테스트 결과",
  //   author: "원장님",
  //   date: "2025-02-19",
  //   content:
  //     "2월 정규 테스트 결과 안내. \n\n 아래 첨부파일을 확인해주세요.(사전에 고지받은 본인 코드로 확인 요망.)",
  //   attachments: [
  //     {
  //       name: "25년02월_정규테스트_결과.pdf",
  //       url: "/files/25년02월_정규테스트_결과.pdf",
  //     },
  //   ],
  // },
];

export default mockNoticeData;
